rofiqcp/Praktikum-Sistem-Embedded/Modul-08-FreeRTOS-Task/praktikum/STM32/STM32_08_Task_Idle_Hook/src/main.c
/**
 * ============================================================================
 * FILE: main.c
 * PROJECT: 04-Idle_Task_Hook
 * 
 * DESKRIPSI PROGRAM:
 * Program ini mendemonstrasikan penggunaan Idle Task Hook di FreeRTOS.
 * Idle Hook adalah callback yang dipanggil setiap kali tidak ada task yang
 * perlu dijalankan (semua task dalam state BLOCKED atau SUSPENDED).
 * 
 * ============================================================================
 * KONSEP DASAR: IDLE TASK DAN IDLE HOOK
 * ============================================================================
 * 
 * IDLE TASK:
 * FreeRTOS secara otomatis membuat task khusus bernama "Idle Task" dengan
 * prioritas terendah (tskIDLE_PRIORITY = 0). Idle task berjalan ketika
 * tidak ada task lain yang ready.
 * 
 * KAPAN IDLE TASK BERJALAN:
 * ┌──────────┐     ┌──────────┐     ┌──────────┐
 * │  Worker  │     │  Worker  │     │  Worker  │
 * │  Running │     │  Running │     │  Running │
 * └────┬─────┘     └────┬─────┘     └────┬─────┘
 *      │vTaskDelay()    │vTaskDelay()    │vTaskDelay()
 *      ▼                ▼                ▼
 * ┌─────────────────────────────────────────────┐
 * │        IDLE TASK BERJALAN (hook dipanggil)   │
 * └─────────────────────────────────────────────┘
 * 
 * KEGUNAAN IDLE HOOK:
 * 1. Power Saving - Masuk ke mode sleep menggunakan __WFI()
 * 2. Background Processing - Garbage collection, cleanup
 * 3. Monitoring - Menghitung idle time untuk estimasi CPU usage
 * 
 * HARDWARE TARGET: STM32F103C8T6 (Blue Pill)
 * - CPU: 72MHz (HSE 8MHz + PLL x9)
 * - LED: PC13 (aktif LOW) - Toggle oleh Worker Task
 * - UART: PA9 (TX), PA10 (RX) @ 115200 baud
 * ============================================================================
 */

/* ============================================================================
 * INCLUDE HEADERS
 * ============================================================================ */

#include "stm32f1xx_hal.h"      /* HAL library untuk STM32F1 series */
#include "FreeRTOS.h"          /* FreeRTOS kernel utama */
#include "task.h"              /* API untuk task management */
#include <string.h>            /* Library untuk strlen() */
#include <stdio.h>             /* Library untuk sprintf() */

/* ============================================================================
 * VARIABEL GLOBAL
 * ============================================================================
 * Variabel volatile karena diakses dari beberapa context:
 * - Idle hook (dari idle task)
 * - Monitor task (untuk membaca statistik)
 * ============================================================================ */

/* Handle UART untuk komunikasi serial debug */
UART_HandleTypeDef huart1;

/* ---------------------------------------------------------------------------
 * COUNTER STATISTIK IDLE
 * ---------------------------------------------------------------------------
 * idleCounter: Menghitung berapa kali idle hook dipanggil
 * sleepCounter: Menghitung berapa kali CPU masuk mode sleep
 * 
 * volatile diperlukan karena:
 * - Dimodifikasi oleh idle hook (context berbeda)
 * - Dibaca oleh monitor task
 * - Compiler tidak boleh mengoptimasi akses
 * --------------------------------------------------------------------------- */
volatile uint32_t idleCounter = 0;   /* Total panggilan idle hook */
volatile uint32_t sleepCounter = 0;  /* Total masuk sleep mode */

/* ============================================================================
 * DEKLARASI FUNGSI (FUNCTION PROTOTYPES)
 * ============================================================================ */

/* Fungsi konfigurasi sistem dan peripheral */
void SystemClock_Config(void);               /* Konfigurasi clock system 72MHz */
static void MX_GPIO_Init(void);              /* Inisialisasi GPIO (LED) */
static void MX_USART1_UART_Init(void);       /* Inisialisasi UART debug */

/* Fungsi utilitas */
void UART_SendString(const char *str);       /* Kirim string via UART */

/* Task FreeRTOS */
void vWorkerTask(void *pvParameters);        /* Task yang melakukan kerja periodik */
void vMonitorTask(void *pvParameters);       /* Task yang melaporkan statistik idle */

/* FreeRTOS hook functions - WAJIB diimplementasikan jika config aktif */
void vApplicationIdleHook(void);             /* HOOK UTAMA - dipanggil saat idle */
void vApplicationMallocFailedHook(void);     /* Dipanggil jika malloc gagal */
void vApplicationStackOverflowHook(TaskHandle_t xTask, char *pcTaskName);

/* ============================================================================
 * FUNGSI: vApplicationIdleHook - INTI DARI DEMO INI
 * ============================================================================
 * Callback yang dipanggil FreeRTOS setiap kali idle task berjalan.
 * 
 * KARAKTERISTIK:
 * - Dipanggil dari context idle task (prioritas terendah)
 * - Tidak boleh memanggil fungsi blocking (vTaskDelay, xQueueReceive, dll)
 * - Harus return cepat agar scheduler bisa berjalan normal
 * - Bisa dipanggil ribuan kali per detik tergantung workload
 * 
 * IMPLEMENTASI DI SINI:
 * 1. Increment counter untuk statistik
 * 2. Masuk ke sleep mode menggunakan __WFI()
 * 
 * __WFI() (Wait For Interrupt):
 * - Instruksi ARM yang menghentikan eksekusi CPU
 * - CPU tidur sampai ada interrupt (termasuk SysTick)
 * - Sangat hemat daya karena CPU tidak clock saat tidur
 * - Bangun otomatis saat ada interrupt apa saja
 * 
 * ESTIMASI POWER SAVING:
 * - STM32F103 @ 72MHz: ~36mA aktif
 * - Sleep mode: ~14mA (hemat ~60%)
 * - Stop mode: ~20µA (perlu konfigurasi lebih lanjut)
 * ============================================================================ */
void vApplicationIdleHook(void) {
    /* ---------------------------------------------------------------------------
     * INCREMENT COUNTER STATISTIK
     * ---------------------------------------------------------------------------
     * idleCounter: Menghitung total panggilan
     * sleepCounter: Menghitung masuk sleep (sama dalam kasus ini)
     * 
     * Dalam aplikasi nyata, bisa berbeda jika ada kondisi dimana
     * tidak selalu masuk sleep (misalnya ada flag yang harus dicek).
     * --------------------------------------------------------------------------- */
    idleCounter++;      /* Hitung panggilan idle hook */
    sleepCounter++;     /* Hitung masuk sleep mode */
    
    /* ---------------------------------------------------------------------------
     * MASUK SLEEP MODE - HEMAT DAYA
     * ---------------------------------------------------------------------------
     * __WFI() adalah intrinsic function untuk instruksi WFI (Wait For Interrupt).
     * 
     * CARA KERJA:
     * 1. CPU berhenti mengeksekusi instruksi
     * 2. Clock CPU dihentikan (tapi peripheral clock tetap jalan)
     * 3. CPU bangun saat ada interrupt (SysTick, UART, GPIO, dll)
     * 4. Eksekusi dilanjutkan dari instruksi setelah WFI
     * 
     * KEUNTUNGAN:
     * - Hemat daya signifikan
     * - Wake-up instant (< 6 clock cycles)
     * - Tidak perlu konfigurasi khusus
     * 
     * ALTERNATIF:
     * __WFE() - Wait For Event (lebih flexible, bisa bangun dari event flag)
     * --------------------------------------------------------------------------- */
    __WFI();  /* Wait For Interrupt - CPU tidur sampai ada interrupt */
    
    /* ---------------------------------------------------------------------------
     * CATATAN PENTING:
     * ---------------------------------------------------------------------------
     * 1. JANGAN panggil vTaskDelay() atau fungsi blocking lainnya!
     *    Idle hook berjalan di context idle task, tidak boleh block.
     * 
     * 2. JANGAN lakukan operasi yang terlalu lama!
     *    Ini akan menunda respons terhadap event lain.
     * 
     * 3. JANGAN alokasi memori dinamis!
     *    Bisa menyebabkan fragmentation atau failure.
     * 
     * 4. BISA lakukan:
     *    - Increment counter
     *    - Set flag
     *    - Toggle GPIO (untuk debugging)
     *    - Masuk sleep mode
     *    - Background cleanup yang cepat
     * --------------------------------------------------------------------------- */
}

/* ============================================================================
 * FUNGSI UTILITAS: UART_SendString
 * ============================================================================
 * Mengirim string melalui UART1 untuk debugging.
 * ============================================================================ */
void UART_SendString(const char *str) {
    HAL_UART_Transmit(&huart1,                /* Handle UART */
                      (uint8_t*)str,          /* Data yang dikirim */
                      strlen(str),            /* Panjang data */
                      HAL_MAX_DELAY);         /* Timeout (blocking) */
}

/* ============================================================================
 * TASK 1: vWorkerTask - TASK YANG MELAKUKAN KERJA PERIODIK
 * ============================================================================
 * Task ini mensimulasikan workload yang berjalan periodik.
 * Saat task ini delay (vTaskDelay), idle task akan berjalan.
 * 
 * ALUR:
 * 1. Lakukan "kerja" (simulasi dengan loop)
 * 2. Toggle LED sebagai indikator
 * 3. Delay 500ms -> idle task berjalan selama ini
 * 4. Repeat
 * 
 * HUBUNGAN DENGAN IDLE HOOK:
 * Semakin lama delay, semakin banyak idle hook dipanggil.
 * Semakin lama "kerja", semakin sedikit idle hook dipanggil.
 * ============================================================================ */
void vWorkerTask(void *pvParameters) {
    /* ---------------------------------------------------------------------------
     * VARIABEL LOKAL
     * --------------------------------------------------------------------------- */
    uint32_t counter = 0;          /* Counter iterasi */
    char buffer[60];               /* Buffer untuk output UART */
    
