rofiqcp/Praktikum-Sistem-Embedded/Modul-08-FreeRTOS-Task/praktikum/STM32/STM32_08_Task_Idle_Hook/src/main.c
    /* Cast parameter yang tidak digunakan untuk menghindari warning */
    (void)pvParameters;
    
    UART_SendString("[Worker] Task dimulai\r\n");
    UART_SendString("[Worker] Periode kerja: ");
    char tmpBuf[20];
    sprintf(tmpBuf, "%d ms\r\n\r\n", WORKER_TASK_PERIOD_MS);
    UART_SendString(tmpBuf);
    
    /* ---------------------------------------------------------------------------
     * INFINITE LOOP
     * --------------------------------------------------------------------------- */
    for(;;) {
        counter++;
        
        /* -----------------------------------------------------------------------
         * SIMULASI WORKLOAD
         * -----------------------------------------------------------------------
         * Loop kosong untuk mensimulasikan CPU bekerja.
         * Selama loop ini berjalan, idle task TIDAK berjalan.
         * ----------------------------------------------------------------------- */
        volatile uint32_t i;
        for(i = 0; i < WORKER_SIMULATION_LOOPS; i++) {
            /* CPU sibuk di sini - idle hook tidak dipanggil */
        }
        
        /* -----------------------------------------------------------------------
         * TOGGLE LED - INDIKATOR KERJA
         * -----------------------------------------------------------------------
         * LED berkedip setiap iterasi menunjukkan task aktif.
         * Frekuensi kedip = 1/(2*WORKER_TASK_PERIOD_MS) Hz
         * Dengan periode 500ms: frekuensi = 1 Hz
         * ----------------------------------------------------------------------- */
        HAL_GPIO_TogglePin(LED_GPIO_PORT, LED_GPIO_PIN);
        
        /* -----------------------------------------------------------------------
         * LAPORAN PERIODIK
         * ----------------------------------------------------------------------- */
        if(counter % WORKER_TASK_REPORT_INTERVAL == 0) {
            sprintf(buffer, "[Worker] Iterasi: %lu selesai\r\n", counter);
            UART_SendString(buffer);
        }
        
        /* -----------------------------------------------------------------------
         * DELAY - SAAT INI IDLE TASK BERJALAN!
         * -----------------------------------------------------------------------
         * Saat vTaskDelay() dipanggil:
         * 1. Worker task masuk state BLOCKED
         * 2. Scheduler mencari task lain yang ready
         * 3. Jika tidak ada task ready, idle task berjalan
         * 4. Idle hook dipanggil berulang kali
         * 5. CPU masuk sleep mode setiap panggilan idle hook
         * 6. Setelah delay selesai, worker task menjadi ready lagi
         * ----------------------------------------------------------------------- */
        vTaskDelay(pdMS_TO_TICKS(WORKER_TASK_PERIOD_MS));
    }
}

/* ============================================================================
 * TASK 2: vMonitorTask - TASK YANG MELAPORKAN STATISTIK IDLE
 * ============================================================================
 * Task ini membaca counter statistik dan melaporkan ke UART.
 * Berguna untuk:
 * - Memantau seberapa sering idle hook dipanggil
 * - Estimasi CPU utilization (lebih banyak idle = CPU lebih santai)
 * 
 * CARA HITUNG CPU UTILIZATION:
 * Jika dalam 1 detik idle hook dipanggil N kali, dan dalam kondisi
 * benar-benar idle (tidak ada task) dipanggil M kali, maka:
 * CPU Utilization = (1 - N/M) * 100%
 * ============================================================================ */
void vMonitorTask(void *pvParameters) {
    /* ---------------------------------------------------------------------------
     * VARIABEL LOKAL
     * --------------------------------------------------------------------------- */
    char buffer[120];              /* Buffer untuk output UART */
    uint32_t lastIdle = 0;         /* Nilai idle counter terakhir */
    uint32_t lastSleep = 0;        /* Nilai sleep counter terakhir */
    uint32_t currentIdle;          /* Nilai idle counter saat ini */
    uint32_t currentSleep;         /* Nilai sleep counter saat ini */
    uint32_t deltaIdle;            /* Perubahan idle counter */
    uint32_t deltaSleep;           /* Perubahan sleep counter */
    
    /* Cast parameter yang tidak digunakan untuk menghindari warning */
    (void)pvParameters;
    
    UART_SendString("[Monitor] Task dimulai\r\n");
    UART_SendString("[Monitor] Periode laporan: ");
    char tmpBuf[20];
    sprintf(tmpBuf, "%d ms\r\n\r\n", MONITOR_TASK_PERIOD_MS);
    UART_SendString(tmpBuf);
    
    /* ---------------------------------------------------------------------------
     * INFINITE LOOP
     * --------------------------------------------------------------------------- */
    for(;;) {
        /* -----------------------------------------------------------------------
         * BACA COUNTER STATISTIK
         * -----------------------------------------------------------------------
         * Counter ini di-update oleh idle hook.
         * Kita hitung delta (perubahan) sejak pembacaan terakhir.
         * ----------------------------------------------------------------------- */
        currentIdle = idleCounter;    /* Baca nilai saat ini */
        currentSleep = sleepCounter;
        
        deltaIdle = currentIdle - lastIdle;    /* Hitung perubahan */
        deltaSleep = currentSleep - lastSleep;
        
        /* -----------------------------------------------------------------------
         * FORMAT DAN KIRIM LAPORAN
         * -----------------------------------------------------------------------
         * Output:
         * - Total panggilan idle hook
         * - Perubahan sejak laporan terakhir
         * - Total masuk sleep mode
         * - Perubahan sleep sejak laporan terakhir
         * ----------------------------------------------------------------------- */
        sprintf(buffer, 
                "[Monitor] Idle: %lu (+%lu), Sleep: %lu (+%lu) dalam %d ms\r\n",
                currentIdle, deltaIdle,
                currentSleep, deltaSleep,
                MONITOR_TASK_PERIOD_MS);
        UART_SendString(buffer);
        
        /* Simpan nilai untuk perhitungan delta berikutnya */
        lastIdle = currentIdle;
        lastSleep = currentSleep;
        
        /* -----------------------------------------------------------------------
         * DELAY SAMPAI LAPORAN BERIKUTNYA
         * ----------------------------------------------------------------------- */
        vTaskDelay(pdMS_TO_TICKS(MONITOR_TASK_PERIOD_MS));
    }
}

/* ============================================================================
 * FUNGSI: SystemClock_Config
 * ============================================================================
 * Mengkonfigurasi system clock STM32F103 ke 72MHz.
 * ============================================================================ */
void SystemClock_Config(void) {
    RCC_OscInitTypeDef RCC_OscInitStruct = {0};
    RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

