rofiqcp/Praktikum-Sistem-Embedded/Modul-08-FreeRTOS-Task/praktikum/STM32/STM32_08_Task_Idle_Hook/src/main.c
    /* Konfigurasi HSE dan PLL */
    RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
    RCC_OscInitStruct.HSEState = RCC_HSE_ON;
    RCC_OscInitStruct.HSEPredivValue = RCC_HSE_PREDIV_DIV1;
    RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
    RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
    RCC_OscInitStruct.PLL.PLLMUL = RCC_PLL_MUL9;          /* 8MHz x 9 = 72MHz */
    HAL_RCC_OscConfig(&RCC_OscInitStruct);

    /* Konfigurasi clock system */
    RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK |
                                  RCC_CLOCKTYPE_SYSCLK |
                                  RCC_CLOCKTYPE_PCLK1 |
                                  RCC_CLOCKTYPE_PCLK2;
    RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
    RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;    /* AHB = 72MHz */
    RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;     /* APB1 = 36MHz */
    RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;     /* APB2 = 72MHz */
    HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2);
}

/* ============================================================================
 * FUNGSI: MX_GPIO_Init
 * ============================================================================
 * Menginisialisasi GPIO untuk LED indicator.
 * ============================================================================ */
static void MX_GPIO_Init(void) {
    GPIO_InitTypeDef GPIO_InitStruct = {0};

    /* Enable clock untuk GPIOC dan GPIOA */
    __HAL_RCC_GPIOC_CLK_ENABLE();
    __HAL_RCC_GPIOA_CLK_ENABLE();

    /* Konfigurasi LED PC13 */
    HAL_GPIO_WritePin(LED_GPIO_PORT, LED_GPIO_PIN, GPIO_PIN_SET);  /* LED mati awal */
    
    GPIO_InitStruct.Pin = LED_GPIO_PIN;
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(LED_GPIO_PORT, &GPIO_InitStruct);
}

/* ============================================================================
 * FUNGSI: MX_USART1_UART_Init
 * ============================================================================
 * Menginisialisasi USART1 untuk komunikasi serial debugging.
 * ============================================================================ */
static void MX_USART1_UART_Init(void) {
    GPIO_InitTypeDef GPIO_InitStruct = {0};

    /* Enable clock */
    __HAL_RCC_USART1_CLK_ENABLE();
    __HAL_RCC_GPIOA_CLK_ENABLE();

    /* PA9 = TX (Alternate Function Push-Pull) */
    GPIO_InitStruct.Pin = DEBUG_UART_TX_PIN;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
    HAL_GPIO_Init(DEBUG_UART_TX_PORT, &GPIO_InitStruct);
    
    /* PA10 = RX (Input) */
    GPIO_InitStruct.Pin = DEBUG_UART_RX_PIN;
    GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    HAL_GPIO_Init(DEBUG_UART_RX_PORT, &GPIO_InitStruct);

    /* Konfigurasi USART1 */
    huart1.Instance = DEBUG_UART_INSTANCE;
    huart1.Init.BaudRate = DEBUG_UART_BAUDRATE;
    huart1.Init.WordLength = UART_WORDLENGTH_8B;
    huart1.Init.StopBits = UART_STOPBITS_1;
    huart1.Init.Parity = UART_PARITY_NONE;
    huart1.Init.Mode = UART_MODE_TX_RX;
    huart1.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    huart1.Init.OverSampling = UART_OVERSAMPLING_16;
    HAL_UART_Init(&huart1);
}

/* ============================================================================
 * FUNGSI: vApplicationMallocFailedHook
 * ============================================================================
 * Callback ketika alokasi memori FreeRTOS gagal.
 * ============================================================================ */
void vApplicationMallocFailedHook(void) {
    UART_SendString("\r\n!!! FATAL: Malloc gagal! Heap penuh. !!!\r\n");
    taskDISABLE_INTERRUPTS();
    for(;;) {
        HAL_GPIO_TogglePin(LED_GPIO_PORT, LED_GPIO_PIN);
        for(volatile uint32_t i = 0; i < 100000; i++);
    }
}

/* ============================================================================
 * FUNGSI: vApplicationStackOverflowHook
 * ============================================================================
 * Callback ketika stack overflow terdeteksi.
 * ============================================================================ */
void vApplicationStackOverflowHook(TaskHandle_t xTask, char *pcTaskName) {
    (void)xTask;
    UART_SendString("\r\n!!! FATAL: Stack Overflow pada task: ");
    UART_SendString(pcTaskName);
    UART_SendString(" !!!\r\n");
    taskDISABLE_INTERRUPTS();
    for(;;) {
        HAL_GPIO_TogglePin(LED_GPIO_PORT, LED_GPIO_PIN);
        for(volatile uint32_t i = 0; i < 50000; i++);
    }
}

/* ============================================================================
 * FUNGSI: SysTick_Handler
 * ============================================================================
 * Interrupt handler untuk SysTick timer.
 * ============================================================================ */
void SysTick_Handler(void) {
    HAL_IncTick();  /* Untuk HAL timing */
    
    if (xTaskGetSchedulerState() != taskSCHEDULER_NOT_STARTED) {
        xPortSysTickHandler();  /* FreeRTOS tick */
    }
}

/* ============================================================================
 * FUNGSI: main
 * ============================================================================
 * Entry point program.
 * ============================================================================ */
int main(void) {
    /* Inisialisasi HAL dan peripheral */
    HAL_Init();
    SystemClock_Config();
    MX_GPIO_Init();
    MX_USART1_UART_Init();

    /* Pesan startup */
    UART_SendString("\r\n");
    UART_SendString("============================================================\r\n");
    UART_SendString("  Program 4: Idle Task Hook Utilization\r\n");
    UART_SendString("============================================================\r\n");
    UART_SendString("\r\n");
    UART_SendString("DESKRIPSI:\r\n");
    UART_SendString("Program ini mendemonstrasikan penggunaan Idle Hook untuk:\r\n");
    UART_SendString("1. Mode hemat daya (CPU sleep dengan __WFI)\r\n");
    UART_SendString("2. Monitoring CPU utilization\r\n");
    UART_SendString("\r\n");
    UART_SendString("CARA KERJA:\r\n");
    UART_SendString("- Worker task bekerja lalu delay (idle hook aktif)\r\n");
    UART_SendString("- Monitor task melaporkan statistik idle\r\n");
    UART_SendString("- Semakin besar idle count = CPU semakin santai\r\n");
    UART_SendString("\r\n");
    UART_SendString("============================================================\r\n\r\n");

    /* ---------------------------------------------------------------------------
     * MEMBUAT TASK FREERTOS
     * ---------------------------------------------------------------------------
     * Worker Task: Prioritas 2 (lebih tinggi)
     * - Melakukan kerja simulasi
     * - Delay 500ms setiap iterasi
     * 
     * Monitor Task: Prioritas 1 (lebih rendah)
     * - Melaporkan statistik setiap 2 detik
     * --------------------------------------------------------------------------- */
    BaseType_t result1 = xTaskCreate(
        vWorkerTask,                /* Fungsi task */
        WORKER_TASK_NAME,           /* Nama task */
        WORKER_TASK_STACK_SIZE,     /* Stack size */
        NULL,                       /* Parameter */
        WORKER_TASK_PRIORITY,       /* Prioritas (2) */
        NULL                        /* Handle */
    );
    
    BaseType_t result2 = xTaskCreate(
        vMonitorTask,               /* Fungsi task */
        MONITOR_TASK_NAME,          /* Nama task */
        MONITOR_TASK_STACK_SIZE,    /* Stack size */
        NULL,                       /* Parameter */
        MONITOR_TASK_PRIORITY,      /* Prioritas (1) */
        NULL                        /* Handle */
    );
    
    /* Cek hasil pembuatan task */
    if(result1 != pdPASS || result2 != pdPASS) {
        UART_SendString("ERROR: Gagal membuat task!\r\n");
        while(1) {
            HAL_GPIO_TogglePin(LED_GPIO_PORT, LED_GPIO_PIN);
            HAL_Delay(100);
        }
    }
    
    UART_SendString("Task berhasil dibuat. Memulai scheduler...\r\n\r\n");

    /* Start FreeRTOS scheduler */
    vTaskStartScheduler();

    /* Seharusnya tidak sampai sini */
    UART_SendString("ERROR: Scheduler gagal start!\r\n");
    while(1) {
        HAL_GPIO_TogglePin(LED_GPIO_PORT, LED_GPIO_PIN);
        HAL_Delay(500);
    }
}
